# Александр Шутов - "Fundupy"
# Пользовательские сценарии

### Группа: 10 - МИ - 4
### Электронная почта: alexev2401@gmail.com
### TG: @justxale


### [ Сценарий 1 - Регистрация пользователя ]

1. Пользователь вводит логин, с которым он будет заходить в систему
2. Пользователь вводит пароль, с которым он будет заходить в систему
3. Пользователь вводит адрес электронной почты, который будет использоваться в системе
4. Если выбранный логин уже существует в системе, то пользователю сообщается об этом и предлагается придумать новый логин
5. Еслли второй логин уже занят, система даёт рекомендации по придумыванию уникального логина
6. Если пароль содержит менее 6 символов, система сообщает, что пароль должен быть от 6 до 30 символов и пользователь должен придумать новый пароль
7. Если введённый адрес электронной почты не соответствует формату, то система выводит сообщение об ошибке и просит ввести адрес ещё раз
8. Если все введённые данные соответствуют требованиям регистрации, то система отправляет на почту письмо для подтверждения почты
9. После подтверждения имейла система приветствует пользователя и переходит в диалог выбора режима работы и тарифного плана.
10. Запускается Сценарий 2 - Выбор режима работы и тарифного плана.

### [ Сценарий 2 - Создание собственного профиля ]

1. На экране появляется список доступных функций в виде названия и чекбокса, который можно отметить, если функция нужна. Также рядом показывается, какую сумму в месяц пользователь будет платить за пользование этой функцией, если функция платная.
2. Одновременно с выбором функций отображается увеличивающаяся итоговая стоимость профиля.
3. После того, как пользователь нажал "Далее", приложение предупреджает пользователя, что он не сможет поменять список функций в течение месяца. Пользователь нажимает "Ок".
4. Далее программа ещё раз спрашивает пользователя, уверен ли он в том, что он хочет финализировать созданный профиль. У пользователя есть возможность вернуться на Шаг 1 или продолжить.
5. Если пользователь продолжает, то он переходит на страницу оплаты. 
6. Если оплата проходит успешно, пользователь переходит в основное окно работы. Если оплата проходит неуспешно, выводится соответствующее сообщение и тариф не меняется.
7. Пользователь переходит к выбору дальнейших действий.